#! /usr/bin/env rexx
/* This is a multiline comment
   It can span multiple lines */

say 'Hello, World!'  -- This is an in-line comment

-- This is a single line comment

if true, -- comment should not break line continuation
& false then say 'false'